Revit 2024 API
Group.IsAttached Property
 Indicates wether or not this group is attached to a parent group.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019.1
Syntax
C#
public bool IsAttached { get; }
Visual Basic
Public ReadOnly Property IsAttached As Boolean
	Get
Visual C++
public:
property bool IsAttached {
	bool get ();
}
See Also
Group Class
Autodesk.Revit.DB Namespace